CF/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/InformationRegisters/НастройкиПользователей/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура записывает таблицу значений в РС "Настройки пользователей", 
// 
Процедура ЗаписатьНастройкиПользователя(ТаблицаНастроек) Экспорт
	
	Если ТаблицаНастроек.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ТаблицаНастроек[0].Пользователь);
		НаборЗаписей.Отбор.Магазин.Установить(ТаблицаНастроек[0].Магазин);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Для каждого СтрокаТаблицыНастроек Из ТаблицаНастроек Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицыНастроек.Значение) Тогда
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицыНастроек);
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
